apache/nuttx/arch/arm/src/stm32h5/stm32h5xx_rcc.c
/****************************************************************************
 * arch/arm/src/stm32h5/stm32h5xx_rcc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <arch/stm32h5/chip.h>
#include <arch/board/board.h>

#include <assert.h>

#include "stm32_pwr.h"
#include "stm32_flash.h"
#include "stm32_rcc.h"
#include "stm32_hsi48.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

static_assert(CONFIG_BOARD_LOOPSPERMSEC != -1,
              "Configure BOARD_LOOPSPERMSEC to non-default value.");

/* Allow up to 100 milliseconds for the high speed clock to become ready.
 * that is a very long delay, but if the clock does not become ready we are
 * hosed anyway.  Normally this is very fast, but I have seen at least one
 * board that required this long, long timeout for the HSE to be ready.
 */

#define HSERDY_TIMEOUT (100 * CONFIG_BOARD_LOOPSPERMSEC)

/* Same for HSI and CSI */

#define HSIRDY_TIMEOUT HSERDY_TIMEOUT
#define LSIRDY_TIMEOUT HSERDY_TIMEOUT
#define CSIRDY_TIMEOUT HSERDY_TIMEOUT

/* HSE divisor to yield ~1MHz RTC clock */

#define HSE_DIVISOR (STM32_HSE_FREQUENCY + 500000) / 1000000

/* Determine if board wants to use HSI48 as 48 MHz oscillator. */

#if defined(CONFIG_STM32_HAVE_HSI48) && defined(STM32_USE_CLK48)
#  if defined(STM32_CLKUSB_SEL)
#    if (STM32_CLKUSB_SEL == RCC_CCIPR4_USBSEL_HSI48KERCK)
#      define STM32_USE_HSI48 1
#    endif
#  endif
#  if defined(STM32_CLKRNG_SEL)
#    if (STM32_CLKRNG_SEL == RCC_CCIPR5_RNGSEL_HSI48KERCK)
#      define STM32_USE_HSI48 1
#    endif
#  endif
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rcc_enableahb1
 *
 * Description:
 *   Enable selected AHB1 peripherals
 *
 ****************************************************************************/

static inline void rcc_enableahb1(void)
{
  uint32_t regval;

  /* Set the appropriate bits in the AHB1ENR register to enabled the
   * selected AHB1 peripherals.
   */

  regval = getreg32(STM32_RCC_AHB1ENR);

#ifdef CONFIG_STM32_DMA1
  /* DMA 1 clock enable */

  regval |= RCC_AHB1ENR_GPDMA1EN;
#endif

#ifdef CONFIG_STM32_DMA2
  /* DMA 2 clock enable */

  regval |= RCC_AHB1ENR_GPDMA2EN;
#endif

#ifdef CONFIG_STM32_FLASH
  /* Flash memory interface clock enable */

  regval |= RCC_AHB1ENR_FLASHEN;
#endif

#ifdef CONFIG_STM32_CRC
  /* CRC clock enable */

  regval |= RCC_AHB1ENR_CRCEN;
#endif

#ifdef CONFIG_STM32_CORDIC
  /* CORDIC clock enable */

  regval |= RCC_AHB1ENR_CORDICEN;
#endif

#ifdef CONFIG_STM32_FMAC
  /* FMAC clock enable */

  regval |= RCC_AHB1ENR_FMACEN;
#endif

#ifdef CONFIG_STM32_RAMCFG
  /* RAMCFG clock enable */

  regval |= RCC_AHB1ENR_RAMCFGEN;
#endif

#ifdef CONFIG_STM32_ETHMAC
  /* ETH clock enable */

  regval |= RCC_AHB1ENR_ETHEN;

  /* ETH TX clock enable */

  regval |= RCC_AHB1ENR_ETHTXEN;

  /* ETH RX clock enable */

  regval |= RCC_AHB1ENR_ETHRXEN;
#endif

#ifdef CONFIG_STM32_TZSC1

  regval |= RCC_AHB1ENR_TZSC1EN;
#endif

#ifdef CONFIG_STM32_BKPRAM
  /* BKPRAM clock enable */

  regval |= RCC_AHB1ENR_BKPRAMEN;
#endif

#ifdef CONFIG_STM32_DCACHE1
  /* DCACHE clock enable */

  regval |= RCC_AHB1ENR_DCACHEEN;
#endif

#ifdef CONFIG_STM32_SRAM1
  /* ETH clock enable */

  regval |= RCC_AHB1ENR_SRAM1EN;
#endif

  putreg32(regval, STM32_RCC_AHB1ENR);   /* Enable peripherals */
}

/****************************************************************************
 * Name: rcc_enableahb2
 *
 * Description:
 *   Enable selected AHB2 peripherals
 *
 ****************************************************************************/

static inline void rcc_enableahb2(void)
{
  uint32_t regval;

  /* Set the appropriate bits in the AHB2ENR register to enable the
   * selected AHB2 peripherals.
   */

  regval = getreg32(STM32_RCC_AHB2ENR);

  /* Enable GPIOA, GPIOB, .... GPIOH */

#if STM32_NPORTS > 0
  regval |= (RCC_AHB2ENR_GPIOAEN
#if STM32_NPORTS > 1
             | RCC_AHB2ENR_GPIOBEN
#endif
#if STM32_NPORTS > 2
             | RCC_AHB2ENR_GPIOCEN
#endif
#if STM32_NPORTS > 3
             | RCC_AHB2ENR_GPIODEN
#endif
#if STM32_NPORTS > 4 && !defined(CONFIG_STM32_STM32H50XXX)
             | RCC_AHB2ENR_GPIOEEN
#endif
#if STM32_NPORTS > 5 && !defined(CONFIG_STM32_STM32H50XXX)
             | RCC_AHB2ENR_GPIOFEN
#endif
#if STM32_NPORTS > 6 && !defined(CONFIG_STM32_STM32H50XXX)
             | RCC_AHB2ENR_GPIOGEN
#endif
#if STM32_NPORTS > 7
             | RCC_AHB2ENR_GPIOHEN
#endif
#if STM32_NPORTS > 8
             | RCC_AHB2ENR_GPIOIEN
#endif

