apache/nuttx/arch/arm/src/stm32h5/stm32h5xx_rcc.c
  regval |= RCC_APB2ENR_SPI6EN;
#endif

#ifdef CONFIG_STM32_SAI1
  /* SAI1 clock enable */

  regval |= RCC_APB2ENR_SAI1EN;
#endif

#ifdef CONFIG_STM32_SAI2
  /* SAI2 clock enable */

  regval |= RCC_APB2ENR_SAI2EN;
#endif

#if defined(CONFIG_STM32_USBFS) || defined(CONFIG_STM32_USBFS_HOST)
  /* USB clock enable */

  regval |= RCC_APB2ENR_USBEN;
#endif

  putreg32(regval, STM32_RCC_APB2ENR);   /* Enable peripherals */
}

/****************************************************************************
 * Name: rcc_enableapb3
 *
 * Description:
 *   Enable selected APB3 peripherals
 *
 ****************************************************************************/

static inline void rcc_enableapb3(void)
{
  uint32_t regval;

  /* Set the appropriate bits in the APB2ENR register to enabled the
   * selected APB2 peripherals.
   */

  regval = getreg32(STM32_RCC_APB3ENR);

#if defined(CONFIG_STM32_SBS) || defined(CONFIG_STM32_ETHMAC)
  /* Bit 1: SBS clock enable */

  regval |= RCC_APB3ENR_SBSEN;
#endif

#ifdef CONFIG_STM32_SPI5
  /* Bit 5: SPI5 clock enable */

  regval |= RCC_APB3ENR_SPI5EN;
#endif

#ifdef CONFIG_STM32_LPUART1
  /* Bit 6: LPUART1 clock enable */

  regval |= RCC_APB3ENR_LPUART1EN;
#endif

#ifdef CONFIG_STM32_I2C3
  /* Bit 7: I2C3 clock enable */

  regval |= RCC_APB3ENR_I2C3EN;
#endif

#ifdef CONFIG_STM32_I2C4
  /* Bit 8: I2C4 clock enable */

  regval |= RCC_APB3ENR_I2C4EN;
#endif

#ifdef CONFIG_STM32_I3C2
  /* Bit 9: I3C2 clock enable */

  regval |= RCC_APB3ENR_I3C2EN;
#endif

#ifdef CONFIG_STM32_LPTIM1
  /* Bit 11: LPTIM1 clock enable */

  regval |= RCC_APB3ENR_LPTIM1EN;
#endif

#ifdef CONFIG_STM32_LPTIM3
  /* Bit 12: LPTIM3 clock enable */

  regval |= RCC_APB3ENR_LPTIM3EN;
#endif

#ifdef CONFIG_STM32_LPTIM4
  /* Bit 13: LPTIM4 clock enable */

  regval |= RCC_APB3ENR_LPTIM4EN;
#endif

#ifdef CONFIG_STM32_LPTIM5
  /* Bit 14: LPTIM5 clock enable */

  regval |= RCC_APB3ENR_LPTIM5EN;
#endif

#ifdef CONFIG_STM32_LPTIM6
  /* Bit 15: LPTIM6 clock enable */

  regval |= RCC_APB3ENR_LPTIM6EN;
#endif

#ifdef CONFIG_STM32_VREF
  /* Bit 20: VREF clock enable */

  regval |= RCC_APB3ENR_VREFEN;
#endif

#ifdef CONFIG_STM32_RTCAPB
  /* Bit 21: RTCABP clock enable */

  regval |= RCC_APB3ENR_RTCAPBEN;
#endif

  /* Enable peripherals */

  putreg32(regval, STM32_RCC_APB3ENR);
}

/****************************************************************************
 * Name: rcc_enableccip
 *
 * Description:
 *   Set peripherals independent clock configuration.
 *
 ****************************************************************************/

static inline void rcc_enableccip(void)
{
  /* Configure UART source clock */
#if defined(STM32_RCC_CCIPR1_USART1SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_USART1SEL_MASK;
  regval |= STM32_RCC_CCIPR1_USART1SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_USART2SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_USART2SEL_MASK;
  regval |= STM32_RCC_CCIPR1_USART2SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_USART3SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_USART3SEL_MASK;
  regval |= STM32_RCC_CCIPR1_USART3SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_UART4SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_UART4SEL_MASK;
  regval |= STM32_RCC_CCIPR1_UART4SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_UART5SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_UART5SEL_MASK;
  regval |= STM32_RCC_CCIPR1_UART5SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_USART6SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_USART6SEL_MASK;
  regval |= STM32_RCC_CCIPR1_USART6SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_UART7SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_UART7SEL_MASK;
  regval |= STM32_RCC_CCIPR1_UART7SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_UART8SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_UART8SEL_MASK;
  regval |= STM32_RCC_CCIPR1_UART8SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_UART9SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_UART9SEL_MASK;
  regval |= STM32_RCC_CCIPR1_UART9SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR1_USART10SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR1);

  regval &= ~RCC_CCIPR1_USART10SEL_MASK;
  regval |= STM32_RCC_CCIPR1_USART10SEL;
  putreg32(regval, STM32_RCC_CCIPR1);
#endif
#if defined(STM32_RCC_CCIPR2_USART11SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR2);

  regval &= ~RCC_CCIPR2_USART11SEL_MASK;
  regval |= STM32_RCC_CCIPR2_USART11SEL;
  putreg32(regval, STM32_RCC_CCIPR2);
#endif
#if defined(STM32_RCC_CCIPR2_UART12SEL)
  uint32_t regval = getreg32(STM32_RCC_CCIPR2);

  regval &= ~RCC_CCIPR2_UART12SEL_MASK;
  regval |= STM32_RCC_CCIPR2_UART12SEL;
  putreg32(regval, STM32_RCC_CCIPR2);
#endif
}

/****************************************************************************
 * Name: rcc_set_flash_latency
 *
 * Description:
 *   Set proper flash latency based on VOS Range and SYSCLK_FREQUENCY.
 *   See table 44 in RM0481.
 *   TODO - Set prefetch enable based on board.h variable.
 *
 ****************************************************************************/

static inline void rcc_set_flash_latency(void)
{
  uint32_t vos = ((getreg32(STM32_PWR_VOSCR) & PWR_VOSCR_VOS_MASK) >>
                   PWR_VOSCR_VOS_SHIFT);

  uint32_t regval;

  if (vos == 0)
    {
      if (STM32_SYSCLK_FREQUENCY <= 20000000)
        {
          regval = FLASH_ACR_LATENCY(0) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 40000000)
        {
          regval = FLASH_ACR_LATENCY(1) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 60000000)
        {
          regval = FLASH_ACR_LATENCY(2) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 80000000)
        {
          regval = FLASH_ACR_LATENCY(3) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else
        {
          regval = FLASH_ACR_LATENCY(4) | FLASH_ACR_WRHIGHFREQ(2);
        }
    }
  else if (vos == 1)
    {
      if (STM32_SYSCLK_FREQUENCY <= 30000000)
        {
          regval = FLASH_ACR_LATENCY(0) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 60000000)
        {
          regval = FLASH_ACR_LATENCY(1) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 90000000)
        {
          regval = FLASH_ACR_LATENCY(2) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 120000000)
        {
          regval = FLASH_ACR_LATENCY(3) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else
        {
          regval = FLASH_ACR_LATENCY(4) | FLASH_ACR_WRHIGHFREQ(2);
        }
    }
  else if (vos == 2)
    {
      if (STM32_SYSCLK_FREQUENCY <= 34000000)
        {
          regval = FLASH_ACR_LATENCY(0) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 68000000)
        {
          regval = FLASH_ACR_LATENCY(1) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 102000000)
        {
          regval = FLASH_ACR_LATENCY(2) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 136000000)
        {
          regval = FLASH_ACR_LATENCY(3) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 170000000)
        {
          regval = FLASH_ACR_LATENCY(4) | FLASH_ACR_WRHIGHFREQ(2);
        }
      else
        {
          regval = FLASH_ACR_LATENCY(5) | FLASH_ACR_WRHIGHFREQ(2);
        }
    }
  else /* vos == 3 */
    {
      if (STM32_SYSCLK_FREQUENCY <= 42000000)
        {
          regval = FLASH_ACR_LATENCY(0) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 84000000)
        {
          regval = FLASH_ACR_LATENCY(1) | FLASH_ACR_WRHIGHFREQ(0);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 126000000)
        {
          regval = FLASH_ACR_LATENCY(2) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 168000000)
        {
          regval = FLASH_ACR_LATENCY(3) | FLASH_ACR_WRHIGHFREQ(1);
        }
      else if (STM32_SYSCLK_FREQUENCY <= 210000000)
        {
          regval = FLASH_ACR_LATENCY(4) | FLASH_ACR_WRHIGHFREQ(2);
        }
      else
        {
          regval = FLASH_ACR_LATENCY(5) | FLASH_ACR_WRHIGHFREQ(2);
        }
    }

  putreg32(regval, STM32_FLASH_ACR);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_rcc_enableperipherals
 ****************************************************************************/

void stm32_rcc_enableperipherals(void)
{
  rcc_enableccip();
  rcc_enableahb1();
  rcc_enableahb2();
  rcc_enableahb4();
  rcc_enableapb1l();
  rcc_enableapb1h();
  rcc_enableapb2();
  rcc_enableapb3();

#ifdef STM32_USE_HSI48
  /* Enable HSI48 clocking to support USB transfers or RNG */

  stm32_enable_hsi48(STM32_HSI48_SYNCSRC);
#endif
}

/****************************************************************************
 * Name: stm32_stdclockconfig
 *
 * Description:
 *   Called to change to new clock based on settings in board.h
 *
 *   NOTE:  This logic would need to be extended if you need to select low-
 *   power clocking modes!
 ****************************************************************************/

#ifndef CONFIG_ARCH_BOARD_STM32_CUSTOM_CLOCKCONFIG
void stm32_stdclockconfig(void)
{
  uint32_t regval;
  volatile int32_t timeout;

