apache/nuttx/arch/arm/src/stm32h5/stm32h5xx_rcc.c
#if defined(STM32_BOARD_USEHSI)
  /* Enable Internal High-Speed Clock (HSI) */

  regval  = getreg32(STM32_RCC_CR);
  regval |= RCC_CR_HSION;           /* Enable HSI */
#ifdef STM32_BOARD_HSIKERON_ENABLE
  regval |= RCC_CR_HSIKERON;        /* Keep HSI on during stop mode */
#endif

#if defined(STM32_BOARD_HSIDIV)
  regval &= ~RCC_CR_HSIDIV_MASK;
  regval |= STM32_BOARD_HSIDIV;
#else
  /* Use default (32 MHz) */
#endif

  putreg32(regval, STM32_RCC_CR);

  /* Wait until the HSI is ready (or until a timeout elapsed) */

  for (timeout = HSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the HSIRDY flag is the set in the CR */

      if ((getreg32(STM32_RCC_CR) & RCC_CR_HSIRDY) != 0 &&
          (getreg32(STM32_RCC_CR) & RCC_CR_HSIDIVF) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

#endif

#if defined(STM32_BOARD_USECSI)
  /* Enable Internal Low Power Internal Clock (CSI) */

  /* Wait until the CSI is either off or ready (or until a timeout elapsed) */

  for (timeout = CSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      if ((regval = getreg32(STM32_RCC_CR)),
          (regval & RCC_CR_CSIRDY) || ~(regval & RCC_CR_CSION))
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

  regval  = getreg32(STM32_RCC_CR);
  regval |= RCC_CR_CSION;    /* Enable CSI */
  putreg32(regval, STM32_RCC_CR);

  /* Wait until the CSI is ready (or until a timeout elapsed) */

  for (timeout = CSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the CSIRDY flag is the set in the CR */

      if ((getreg32(STM32_RCC_CR) & RCC_CR_CSIRDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }
#endif

#if defined(STM32_BOARD_USEHSE)
  /* Enable External High-Speed Clock (HSE) */

  regval  = getreg32(STM32_RCC_CR);
  regval &= ~(RCC_CR_HSEBYP | RCC_CR_HSEEXT);
#ifdef STM32_HSEBYP_ENABLE
  regval |= RCC_CR_HSEBYP;          /* External oscillator */
#  ifdef STM32_HSEEXT_ENABLE
  regval |= RCC_CR_HSEEXT;          /* Digital bypass input */
#  endif
#endif
  regval |= RCC_CR_HSEON;           /* Enable HSE */
  putreg32(regval, STM32_RCC_CR);

  /* Wait until the HSE is ready (or until a timeout elapsed) */

  for (timeout = HSERDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the HSERDY flag is the set in the CR */

      if ((getreg32(STM32_RCC_CR) & RCC_CR_HSERDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }
#endif

#if !defined(STM32_BOARD_USEHSE) && !defined(STM32_BOARD_USEHSI) && !defined(STM32_BOARD_USECSI)
#  error stm32h5_stdclockconfig(), must have one of STM32_BOARD_USEHSI, STM32_BOARD_USECSI, STM32_BOARD_USEHSE defined
#endif

  /* Check for a timeout.  If this timeout occurs, then we are hosed.  We
   * have no real back-up plan, although the following logic makes it look
   * as though we do.
   */

  if (timeout > 0)
    {
      /* Select main regulator voltage range according to system clock
       * frequency.
       */

      stm32_pwr_adjustvcore(STM32_SYSCLK_FREQUENCY);

      regval  = getreg32(STM32_RCC_CFGR2);

      /* Set the HCLK source/divider */

      regval &= ~RCC_CFGR2_HPRE_MASK;
      regval |= STM32_RCC_CFGR2_HPRE;

      /* Set the PCLK1 divider */

      regval &= ~RCC_CFGR2_PPRE1_MASK;
      regval |= STM32_RCC_CFGR2_PPRE1;

      /* Set the PCLK2 divider */

      regval &= ~RCC_CFGR2_PPRE2_MASK;
      regval |= STM32_RCC_CFGR2_PPRE2;

      /* Set the PCLK3 divider */

      regval &= ~RCC_CFGR2_PPRE3_MASK;
      regval |= STM32_RCC_CFGR2_PPRE3;

      putreg32(regval, STM32_RCC_CFGR2);

#ifdef CONFIG_STM32_RTC_HSECLOCK
      /* Set the RTC clock divisor */

      regval  = getreg32(STM32_RCC_CFGR1);
      regval &= ~RCC_CFGR1_RTCPRE_MASK;
      regval |= RCC_CFGR1_RTCPRE(HSE_DIVISOR);
      putreg32(regval, STM32_RCC_CFGR1);
#endif

#ifdef STM32_PLLCFG_PLL2CFG
      /* Configure PLL2 */

      regval = STM32_PLLCFG_PLL2CFG;
      putreg32(regval, STM32_RCC_PLL2CFGR);

      regval = STM32_PLLCFG_PLL2DIVR;
      putreg32(regval, STM32_RCC_PLL2DIVR);

      /* Enable PLL2 */

      regval  = getreg32(STM32_RCC_CR);
      regval |= RCC_CR_PLL2ON;
      putreg32(regval, STM32_RCC_CR);

      /* Wait until PLL2 is ready */

      while ((getreg32(STM32_RCC_CR) & RCC_CR_PLL2RDY) == 0)
        {
        }

#ifdef STM32_PLLCFG_PLL2FRACR
      regval = STM32_PLLCFG_PLL2FRACR;
      putreg32(regval, STM32_RCC_PLL2FRACR);
#endif
#endif

#ifdef STM32_PLLCFG_PLL3CFG
      /* Configure PLL3 */

      regval = STM32_PLLCFG_PLL3CFG;
      putreg32(regval, STM32_RCC_PLL3CFGR);

      regval = STM32_PLLCFG_PLL3DIVR;
      putreg32(regval, STM32_RCC_PLL3DIVR);

      /* Enable PLL3 */

      regval  = getreg32(STM32_RCC_CR);
      regval |= RCC_CR_PLL3ON;
      putreg32(regval, STM32_RCC_CR);

#ifdef STM32_PLLCFG_PLL3FRACR
      regval = STM32_PLLCFG_PLL3FRACR;
      putreg32(regval, STM32_RCC_PLL3FRACR);
#endif
#endif

#ifdef STM32_PLLCFG_PLL1CFG
      /* Configure PLL1
       * No need for Read modify write. Either reset val = 0 or register is
       * fully defined in board.h
       */

      regval = STM32_PLLCFG_PLL1CFG;
      putreg32(regval, STM32_RCC_PLL1CFGR);

      regval = STM32_PLLCFG_PLL1DIVR;
      putreg32(regval, STM32_RCC_PLL1DIVR);

#ifdef STM32_PLLCFG_PLL1FRACR
      regval = STM32_PLLCFG_PLL1FRACR;
      putreg32(regval, STM32_RCC_PLL1FRACR);
#endif

      /* Enable PLL1 */

      regval  = getreg32(STM32_RCC_CR);
      regval |= RCC_CR_PLL1ON;
      putreg32(regval, STM32_RCC_CR);

      /* Wait until PLL1 is ready, since it is used for system clock */

      while ((getreg32(STM32_RCC_CR) & RCC_CR_PLL1RDY) == 0)
        {
        }
#endif

      /* Determine wait states based on sysclk frequency and VOS
       * Determine WRHIGHFREQ based on wait states
       */

      rcc_set_flash_latency();

      /* Select the main PLL as system clock source */

