apache/nuttx/arch/arm/src/stm32h5/stm32h5xx_rcc.c
      regval  = getreg32(STM32_RCC_CFGR1);
      regval &= ~RCC_CFGR1_SW_MASK;
      regval |= RCC_CFGR1_SW_PLL;
      putreg32(regval, STM32_RCC_CFGR1);

      /* Wait until the PLL source is used as the system clock source */

      while ((getreg32(STM32_RCC_CFGR1) & RCC_CFGR1_SWS_MASK) !=
             RCC_CFGR1_SWS_PLL)
        {
        }

#if defined(CONFIG_STM32_IWDG) || defined(CONFIG_STM32_RTC_LSICLOCK) || \
    defined(STM32_USE_LSCO_LSI)

      /* Low speed internal clock source LSI */

      stm32_rcc_enablelsi();
#endif

#if defined(STM32_USE_LSE) || defined(STM32_USE_LSCO_LSE)
      /* Low speed external clock source LSE */

      stm32_rcc_enablelse();
#else
      /* There is another case where the LSE needs to
       * be enabled: if the MCO1 pin selects LSE as source.
       * Other cases can be handled by peripheral drivers.
       */

      if ((getreg32(STM32_RCC_CFGR1) & RCC_CFGR1_MCO1SEL_MASK) ==
           RCC_CFGR1_MCO1SEL_LSE)
        {
          stm32_rcc_enablelse();
        }

#endif /* STM32_USE_LSE */

      /* Configure ADC source clock */

#if defined(STM32_RCC_CCIPR5_ADCDACSEL)
      regval = getreg32(STM32_RCC_CCIPR5);
      regval &= ~RCC_CCIPR5_ADCDACSEL_MASK;
      regval |= STM32_RCC_CCIPR5_ADCDACSEL;
      putreg32(regval, STM32_RCC_CCIPR5);
#endif

      /* Configure FDCAN source clock */
#if defined(STM32_RCC_CCIPR5_FDCANSEL)
      regval = getreg32(STM32_RCC_CCIPR5);
      regval &= ~RCC_CCIPR5_FDCANSEL_MASK;
      regval |= STM32_RCC_CCIPR5_FDCANSEL;
      putreg32(regval, STM32_RCC_CCIPR5);
#endif
      /* Configure OCTOSPI1 source clock */

#if defined(STM32_RCC_CCIPR4_OCTOSPI1SEL)
      regval = getreg32(STM32_RCC_CCIPR4);
      regval &= ~RCC_CCIPR4_OCTOSPI1SEL_MASK;
      regval |= STM32_RCC_CCIPR4_OCTOSPI1SEL;
      putreg32(regval, STM32_RCC_CCIPR4);
#endif

      /* Configure SPI1 source clock */

#if defined(STM32_RCC_CCIPR3_SPI1SEL)
      regval = getreg32(STM32_RCC_CCIPR3);
      regval &= ~RCC_CCIPR3_SPI1SEL_MASK;
      regval |= STM32_RCC_CCIPR3_SPI1SEL;
      putreg32(regval, STM32_RCC_CCIPR3);
#endif

      /* Configure SPI2 source clock */

#if defined(STM32_RCC_CCIPR3_SPI2SEL)
      regval = getreg32(STM32_RCC_CCIPR3);
      regval &= ~RCC_CCIPR3_SPI2SEL_MASK;
      regval |= STM32_RCC_CCIPR3_SPI2SEL;
      putreg32(regval, STM32_RCC_CCIPR3);
#endif

      /* Configure SPI3 source clock */

#if defined(STM32_RCC_CCIPR3_SPI3SEL)
      regval = getreg32(STM32_RCC_CCIPR3);
      regval &= ~RCC_CCIPR3_SPI3SEL_MASK;
      regval |= STM32_RCC_CCIPR3_SPI3SEL;
      putreg32(regval, STM32_RCC_CCIPR3);
#endif

      /* Configure SPI4 source clock */

#if defined(STM32_RCC_CCIPR3_SPI4SEL)
      regval = getreg32(STM32_RCC_CCIPR3);
      regval &= ~RCC_CCIPR3_SPI4SEL_MASK;
      regval |= STM32_RCC_CCIPR3_SPI4SEL;
      putreg32(regval, STM32_RCC_CCIPR3);
#endif

      /* Configure SPI5 source clock */

#if defined(STM32_RCC_CCIPR3_SPI5SEL)
      regval = getreg32(STM32_RCC_CCIPR3);
      regval &= ~RCC_CCIPR3_SPI5SEL_MASK;
      regval |= STM32_RCC_CCIPR3_SPI5SEL;
      putreg32(regval, STM32_RCC_CCIPR3);
#endif

      /* Configure SPI6 source clock */

#if defined(STM32_RCC_CCIPR3_SPI6SEL)
      regval = getreg32(STM32_RCC_CCIPR3);
      regval &= ~RCC_CCIPR3_SPI6SEL_MASK;
      regval |= STM32_RCC_CCIPR3_SPI6SEL;
      putreg32(regval, STM32_RCC_CCIPR3);
#endif

      /* Configure USB source clock */

#if defined(STM32_CLKUSB_SEL)
      regval = getreg32(STM32_RCC_CCIPR4);
      regval &= ~RCC_CCIPR4_USBSEL_MASK;
      regval |= STM32_CLKUSB_SEL;
      putreg32(regval, STM32_RCC_CCIPR4);
#endif

      /* Configure RNG source clock */

#if defined(STM32_CLKRNG_SEL)
      regval = getreg32(STM32_RCC_CCIPR5);
      regval &= ~RCC_CCIPR5_RNGSEL_MASK;
      regval |= STM32_CLKRNG_SEL;
      putreg32(regval, STM32_RCC_CCIPR5);
#endif
    }
}
#endif
